// 1
// принимает строку для поиска
// возвращает массив объектов пользователей GitHub или null, если произошла ошибка
// запрос к GitHub API должен быть асинхронным
// документация: https://developer.github.com/v3/search/#search-users
// использовать fetch
function loadGitHubUsers (searchString) {}

// 1*
// создать на основе GitHub API компонент поиска пользователей GitHub
// нужен инпут для ввода поисковой строки и кнопка "Найти" для выполнения поиска
// если запрос к GitHub API возвращает объекты пользователей, отобразить имена первых пятерых удобным для вас способом - например, списком
// если по запросу ничего не найдено, отобразить соответствующее уведомление
// если произошла ошибка, отобразить её текст

// 2*
// https://www.youtube.com/watch?v=j4_9BZezSUA